package game;

public class proj_diary {
	//这是一个简易的项目日志
	
	
	 // ======================================================================================
	/* 12.30
	  * 完全实现了Background，bullet，zombie，card类，
	 * ice_bullet僵尸减慢动作没有实现
	 * musicandsound还不能循环播放音乐
	 * gamefield和主程序尚未成型
	 * zombie的子类的图片尚需完善
	 * zombie 对植物的伤害设置为-=2；redzombie为--，这个需要植物的生命值根据运行时间做出调整
	 */
	//=========================================================================================
	
	/*12.31
	 * 完成了四种僵尸的图形
	 * 根据redzombie 每秒-10，health--，算出基础植物生命为170
	 * 放置植物的时候把y按照85除
	 * 完全实现了植物！
	 * 重新调整了画面宽度
	 * 剩余游戏主界面和整体架构
	 * 
	 *
	 */
	//=========================================================================================
	
	/*1.1
	 * 完成了游戏界面
	 * 游戏界面还剩余游戏结束的两个画面转换未实现
	 * 现在剩余运行框架，准备界面，游戏胜利失败界面和ice_bullet魔法效果
	 * 
	 * 
	 * 1.1  5：38  实现了preparepanel  数值尚未确定需要调整
	 * 
	 * 
	 * 1.1下午 几乎实现了基本功能
	 * 剩余寒冰射手的冰冻效果/游戏结束界面/僵尸音效 
	 * bug：经常会卡住/子弹射到僵尸上以后卡住
	 */
	
	//==========================================================================================
     /*1.2  1点
          * 实现了游戏 
         * 剩余 寒冰射手冷冻效果/阳光notify的异常问题/声音/游戏暂停继续
      * 
      * 
      * 1.2  3点
      * 解决了阳光卡顿问题
      * 
      * 
      * 1.2 4点
      * 解决了暂停和重启
      * 
      * 1.2 6点
      * 完成了所有音乐
      * 
      * 
      * 1.2    7:45 实现寒冰射手
      *             整体完成！
      */
	
	
}